
"""
打印出Python之禅，并且翻译

Version:1.0
Author:chaishuai

"""

import this

print('                                                           ')
print('==========================================================')
print('                                                           ')

print('优美胜于丑陋。')
print('显式胜于隐式。')
print('简单胜于复杂。')
print('复杂胜于难懂。')
print('扁平胜于嵌套。')
print('稀疏胜于紧密。')
print('可读性应当被重视。')
print('尽管实用性会打败纯粹性，特例也不能凌驾于规则之上。')
print('不要忽略任何错误，除非你确认这么做。')
print('面对不明确的定义，拒接猜测的诱惑。')
print('找到一种最好的唯一的一种方法去解决问题。')
print('虽然一开始这种方法并不是显而易见，因为你不是Python之父。')
print('做好过不做，但没有思考的做还不如不做。')
print('如果实现很难说明，那它是个坏想法。')
print('如果实现很容易解释，那它有可能是个好想法。')
print('命名空间是个绝妙的方法，请多加利用。')